<a href="https://colab.research.google.com/github/LeeHuiJong/SkillTreePython-DataAnalysis/blob/main/09_%EC%A0%84%EC%B2%98%EB%A6%AC%EC%8B%A4%EC%8A%B5_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Ch09. 전처리 실습 - Titanic
---
* 날짜:
* 이름:

**소개**

  - [타이타닉 데이터셋](https://www.kaggle.com/c/titanic) 전처리를 진행 합니다.
  - [파이썬 데이터전처리 실습-Titanic](https://wikidocs.net/86297)를 참고하여 전처리를 진행 합니다.
  - 향후 이 코드를 이어서 사용하니 코드를 잘 정리해 주세요.

## 데이터 전처리
---

In [ ]:
import pandas as pd  # 판다스를 쓰기 위해 import하고 쓰기 쉽게 pd로 정의 한다

## 01. csv 파일을 데이터프레임으로 로드하기

In [ ]:
train = pd.read_csv('train.csv')
train                              # pd.read_csv 는 괄호 안에 있는 파일명의 파일을 읽어 로드하는 함수. train 한번 더 써서 전반적인 데이터를 볼 수도 있다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## 02. 로드한 데이터 셋에 결측치가 있는지 확인하기

In [ ]:
train.isnull().sum()  # .isnull 함수는 결측치가 무었인지 보여주는 함수다 뒤에 sum을 쓰면 각 항목(컬럼)의 결측치 수의 합을 보여준다.
                      # Age,Cabin,Embarked 항목에만 결측치가 있고 나머지 항목은 결측치가 존재하지 않는다.

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

## 03. 학습 데이터 셋의 상위 5개 항목 출력

In [ ]:
train.head()  # .head 메서드로 상위 5개의 데이터를 출력 가능. tail을 쓰면 마지막 5개를 출력한다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 04. 학습 데이터 셋의 각 필드 데이터 분포(평균, 최소값, 최대값 등)를 살펴보기

In [ ]:
train.describe()  # describe 함수는 수치화 되어있는 자료의 전반적인 통계값을 보여준다. 여기서는 Name, Sex, Ticket, Cabin, Embarked 항목만 제외하고 출력되었다.

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## 05. 각 컬럼의 데이터 타입 확인하기

In [ ]:
train.dtypes  # .dtype은 각 항목(컬럼)의 데이터 타입을 전반적으로 보여주는 함수다. 
              #  위에 describe 함수에서 볼 수 있듯이 Name, Sex, Ticket, Cabin, Embarked 항목만 제외되었는데 이것들은 object 타입이라 그렇다.

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## 06. 'Cabin', 'Embarked'필드에는 어떤 값이 있는지 확인하기

In [ ]:
train.Cabin.unique()  # .'데이터의 항목명' 을 쓰면 모든 데이터가 출력되지만 .unique()와 함께 쓰면 중복되는 데이터가 하나만 나타난다.
                      # 이 항목은 객실의 번호를 나타낸다.

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [ ]:
train.Embarked.unique()  # 위와 같은 함수를 썻고 승선 항구 이름을 나타내고 있다. 
                         # 승선 항구는 총 3개이다.

array(['S', 'C', 'Q', nan], dtype=object)

## 07. 생존한 사람, 사망한 사람의 수 확인하기

In [ ]:
train.Survived.value_counts()   # .value_count() 함수는 항목에 있는 데이터들과 그 수를 나타낸다.
                                # 0=사망자 549명 1=생존자 342명 이다.

0    549
1    342
Name: Survived, dtype: int64

## 08. 각 클래스('Pclass')별 탑승객 분포 확인하기

In [ ]:
train.Pclass.value_counts()   # 위와 같은 함수를 사용
                              # 3등급 491명 2등급 216명 1등급 184명 이다.

3    491
1    216
2    184
Name: Pclass, dtype: int64

## 09. 성('Sex')별 탑승객 분표 확인하기

In [ ]:
train.Sex.value_counts()    # 위와 같은 함수 사용
                            # 전반적인 데이터는 남자 577명  여자 314명  이다.

male      577
female    314
Name: Sex, dtype: int64

## 11. 'Embarked' 필드의 결측치는 값이 가장 많은 'S'로 할당하기

In [ ]:
train['Embarked'] = train['Embarked'].fillna('S')   # .fillna 함수는 . 앞의 항목에 있는 결측치를 특정한 문자로 대체하는 함수이다.

## 12. 'Age' 필드의 결측치는 값이 중간값으로 할당하기

In [ ]:
train['Age'] = train['Age'].fillna(train['Age'].median())  # 위와 같은 함수를 사용, Age 항목의 결측치를 Age의 중간값(median)으로 설정했다.

## 13. 'Name'필드에서 신분을 나타내는 단어를 뽑아서 'Title' 필드에 할당하기

In [ ]:
train['Title'] = train['Name'].str.extract('([A-Za-z]+)\.', expand=False)   # extract 함수를 쓰면 특정한 문자의 함수를 뽑아서 항목에 할당할 수 있다. expand가 True면 콜럼 단위고 False면 label 별로 뽑는다
train['Title'].value_counts()                                               # 여기서는 알파벳 다음 '.'이 달려있는 단어는 신분을 나타내는 단어들이므로 이 요소들을 뽑아낸다.
                                                                            # 총 17 종류의 신분을 나타내는 단어가 있고 가장 많은건 Mr 를 나타내는 것이다.

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Mlle          2
Major         2
Col           2
Countess      1
Capt          1
Ms            1
Sir           1
Lady          1
Mme           1
Don           1
Jonkheer      1
Name: Title, dtype: int64

## 14. 'Title' 필드의 카테고리를 6개의 항목으로 변경하기

In [ ]:
train['Title'] = train['Title'].replace(['Capt', 'Col', 'Major', 'Dr', 'Rev'], 'Officer')   # Officer 범주    # .replace 함수를 사용함으로써 title 항목에 있는 요소들을 특정 범주로 묶어준다.
train['Title'] = train['Title'].replace(['Jonkheer', 'Master'], 'Master')   # Master 범주
train['Title'] = train['Title'].replace(['Don', 'Sir', 'the Countess', 'Lady', 'Dona'], 'Royalty') # Royalty 범주
train['Title'] = train['Title'].replace(['Mme', 'Ms', 'Mrs'], 'Mrs')  # Mrs 범주
train['Title'] = train['Title'].replace(['Mlle', 'Miss'], 'Miss')  # Miss 범주
train['Title'] = train['Title'].replace(['Mr'], 'Mr')  # Mr 범주

## 16. 변수 y를 선언해서 학습할 목표변수(=종속변수)인 'Survived'필드값을 담기

In [ ]:
y=train['Survived']   # Survived 항목을 y에 정의 시켜서 종속변수로 설정한다.

## 17. 나이('Age') 필드를 그룹핑하여 'AgeGroup'필드 생성하여 할당하기

In [ ]:
bins=[0,20,40,60,80,100]                                     # 먼저 Agegroup 에 해당하는 범위를 설정해준다
age1=['0~20th','20~40th','40~60th','60~80th','80~100th']     # 5분위 하려면 0, 20, 40, 60, 80, 100 기준으로 bin을 나누고 age 필드의 이름을 정해준다.

In [ ]:
train['AgeGroup']=pd.cut(train['Age'], bins=bins, labels=age1)  # 정해준 bins 와 labels를 사용해 .cut 함수와 함께 나눈다.